Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: When used after a command that takes an argument, such as |f| or |m|, the timeout set with 'ttimeoutlen' applies.
es_es: Si usa esto después de una orden que toma un argumento, como |f| o |m|, se aplicará la cuenta atrás definida con 'ttimeoutlen'.

source: *CTRL-\_CTRL-G* *i_CTRL-\_CTRL-G* *c_CTRL-\_CTRL-G* *v_CTRL-\_CTRL-G* The command CTRL-\ CTRL-G or <C-\><C-G> can be used to go to Insert mode when 'insertmode' is set.
es_es: *CTRL-\_CTRL-G* *i_CTRL-\_CTRL-G* *c_CTRL-\_CTRL-G* *v_CTRL-\_CTRL-G* La orden CTRL-\ CTRL-G o <C-\><C-G> se puede usar para pasar al modo Insertar cuando 'insertmode' está definido.

source: Otherwise it goes to Normal mode.
es_es: En caso contrario, vuelve al modo Normal.

source: This can be used to make sure Vim is in the mode indicated by 'insertmode', without knowing in what mode Vim currently is.
es_es: Puede usar esto para asegurarse de que Vim está en el modo indicado por 'insertmode', sin conocer el modo actual en el que está Vim.

source: The window contents *window-contents*
es_es: El contenido de las ventanas *ventanas-contenido* *window-contents*

source: In Normal mode and Insert/Replace mode the screen window will show the current contents of the buffer: What You See Is What You Get.
es_es: La ventana muestra los contenidos actuales del búfer en modo Normal y modo Insertar/Reemplazar: lo que ve es lo que hay.

source: There are two exceptions: - When the 'cpoptions' option contains '$', and the change is within one line, the text is not directly deleted, but a '$' is put at the last deleted character.
es_es: Hay dos excepciones: - Si la opción 'cppoptions' contiene «$», y el cambio se realizará dentro de una línea, el texto no se eliminará directamente, sino que se insertará «$» en el último carácter eliminado.

source: - When inserting text in one window, other windows on the same text are not updated until the insert is finished.
es_es: - Si inserta texto en una ventana, otras ventanas mostrando el mismo contenido no se actualizarán hasta finalizar la inserción.

source: {Vi: The screen is not always updated on slow terminals}
es_es: {Vi: La pantalla no se refrescará siempre en terminales lentas}

source: Lines longer than the window width will wrap, unless the 'wrap' option is off (see below).
es_es: Las líneas más largas que el ancho de la ventana se justificarán a menos que la opción 'wrap' esté desactivada (consulte a continuación).

source: The 'linebreak' option can be set to wrap at a blank character.
es_es: La opción 'linebreak' se puede configurar para justificar a partir de un carácter vacío.

source: If there is a single line that is too long to fit in the window, this is a special situation.
es_es: Una situación particular es cuando existe una sola línea que no encaja en la ventana.

source: Vim will show only part of the line, around where the cursor is.
es_es: Vim mostrará solo la parte de la línea en torno al cursor.

source: There are no special characters shown, so that you can edit all parts of this line.
es_es: No verá caracteres especiales, para que así pueda editar esa parte de la línea.

source: {Vi: gives an "internal error" on lines that do not fit in the window}
es_es: {Vi: devuelve un «error interno» en las líneas que no encajan en la ventana.}

source: The '@' occasion in the 'highlight' option can be used to set special highlighting for the '@' and '~' characters.
es_es: La aparición de «@» en la opción 'highlight' (resaltar) se puede usar para dar un resaltado especial a los caracteres «@» y «~».

source: This makes it possible to distinguish them from real characters in the buffer.
es_es: Esto posibilita distinguirlos de aquellos caracteres reales en el búfer.

source: All normal ASCII characters are displayed directly on the screen.
es_es: Todos los caracteres normales ASCII aparecerán directamente en la pantalla.

source: The <Tab> is replaced with the number of spaces that it represents.
es_es: La tecla <Tab> será reemplazada por el número de espacios que representa.

source: Other non-printing characters are replaced with "^{char}", where {char} is the non-printing character with 64 added.
es_es: Otros caracteres no imprimibles se reemplazarán por «^{char}», donde {char} es el carácter no imprimible más la suma de 64.

source: Thus character 7 (bell) will be shown as "^G".
es_es: Por ello, el carácter 7 (campana) aparecerá como «^G».

source: Characters between 127 and 160 are replaced with "~{char}", where {char} is the character with 64 subtracted.
es_es: Los caracteres entre el 127 y el 160 serán reemplazados por «~{char}», donde {char} es el carácter menos la resta de 64.

source: These characters occupy more than one position on the screen.
es_es: Estos caracteres tomarán más de un espacio en la pantalla.

source: The cursor can only be positioned on the first one.
es_es: El cursor sólo aparecerá sobre el primero.

source: If you set the 'number' option, all lines will be preceded with their number.
es_es: Si activa la opción 'number', todas las líneas estarán precedidas por su número.

source: Tip: If you don't like wrapping lines to mix with the line numbers, set the 'showbreak' option to eight spaces: ":set showbreak=\ \ \ \ \ \ \ \ "
es_es: Consejo: Si no le gusta que el justificado de línea se mezcle con los números de línea, configure la opción 'showbreak' con 8 espacios: «:set showbreak=\ \ \ \ \ \ \ \ »

source: If you set the 'list' option, <Tab> characters will not be shown as several spaces, but as "^I".
es_es: Los caracteres <Tab> aparecerán como ^I, en lugar de como varios espacios, en caso de activar la opción 'list'.

source: A '$' will be placed at the end of the line, so you can find trailing blanks.
es_es: Se insertará un «$» al final de la línea para así poder encontrar caracteres en exceso al final de la línea.

source: In Command-line mode only the command-line itself is shown correctly.
es_es: En el modo Línea de órdenes, sólo la misma línea de órdenes se mostrará correctamente.

source: The display of the buffer contents is updated as soon as you go back to Command mode.
es_es: La vista de los contenidos del búfer se actualizarán tan pronto como vuelva al modo de órdenes.

source: The last line of the window is used for status and other messages.
es_es: La última línea de la ventana se usa para mostrar el estado y otros mensajes.

source: The status messages will only be used if an option is on:
es_es: Sólo se mostrarán los mensajes de estado si activa una opción:

source: The current mode is "-- INSERT --" or "-- REPLACE --", see |'showmode'|.
es_es: El modo actual es «-- INSERT --» o «-- REPLACE --», consulte |'showmode|.

source: The command characters are those that you typed but were not used yet.
es_es: Los caracteres de la orden son aquellos que tecleó pero que aún no ha ejectuado.

source: {Vi: does not show the characters you typed or the cursor position}
es_es: {Vi: no muestra los caracteres que ha introducido, o la posición del cursor.}

source: If there is an error, an error message will be shown for at least one second (in reverse video).
es_es: En caso de error, verá un mensaje de error durante al menos un segundo (en vídeo inverso).

source: {Vi: error messages may be overwritten with other messages before you have a chance to read them}
es_es: {Vi: puede que los mensajes de error sean sobreescritos antes de poder leerlos.}

source: Some commands show how many lines were affected.
es_es: Algunas órdenes muestran cuantas líneas fueron afectadas.

source: Above which threshold this happens can be controlled with the 'report' option (default 2).
es_es: Puede controlar el umbral a partir del cual esto ocurre con la opción 'report' (2 por omisión).

source: On the Amiga Vim will run in a CLI window.
es_es: Vim se ejecutará en una ventana CLI bajo Amiga.

source: The name Vim and the full name of the current file name will be shown in the title bar.
es_es: El nombre «Vim» y el nombre completo del archivo aparecerán en la barra de título.

source: When the window is resized, Vim will automatically redraw the window.
es_es: Vim redibujará la ventana en caso de redimensionarla.

source: You may make the window as small as you like, but if it gets too small not a single line will fit in it.
es_es: Puede reducir la ventana tanto como quiera, pero no cabrá ni una línea en caso de reducirla demasiado.

source: Make it at least 40 characters wide to be able to read most messages on the last line.
es_es: Haga que tenga, por lo menos, un ancho de 40 columnas para poder leer la mayoría de mensajes en la última línea.

source: On most Unix systems, resizing the window is recognized and handled correctly by Vim.
es_es: En la mayoría de sistemas Unix Vim trata adecuadamente redimensionar las ventanas.

source: Definitions *definitions*
es_es: Definiciones *definiciones* *definitions*

source: screen The whole area that Vim uses to work in.
es_es: pantalla El área completa que usa Vim.

source: This can be a terminal emulator window.
es_es: Puede ser la ventana de un emulador de terminal.

source: Also called "the Vim window".
es_es: También llamada la «ventana de Vim».

source: window A view on a buffer.
es_es: ventana El área de visión de un búfer.

source: The command line is also used for messages.
es_es: La línea de órdenes se usa también para mensajes.

source: It scrolls up the screen when there is not enough room in the command line.
es_es: Desplaza la pantalla hacia arriba cuando no hay suficiente espacio para la línea de órdenes.

source: 1. one 1. one 1.
es_es: 1. uno 1. uno 1.

source: +-- folded 1.
es_es: +-- plegado 1.

source: +-- folded 2. two 2.
es_es: +-- plegado 2. dos 2.

source: +-- folded 2. five 2.
es_es: +-- plegado 2. cinco 2.

source: five 3. three 3. five 3. six 3.
es_es: cinco 3. tres 3. cinco 3. seis 3.

source: six 4. four 4. six 4. seven 4.
es_es: seis 4. cuatro 4. seis 4. siete 4.

source: seven 5. five 5. seven 5.
es_es: siete 5. cinco 5. siete 5.

source: === status line === 6. six 6.
es_es: === línea de estado === 6. seis 6.

source: aaa 7. seven 7.
es_es: aaa 7. siete 7.

source: === status line === 5. ddd 13.
es_es: === línea de estado === 5. ddd 13.

source: (command line) 6.
es_es: (línea de órdenes) 6.

source: *usr_21.txt* For Vim version 7.3.
es_es: *usr_21.esx* Para Vim version 7.3.

source: Last change: 2008 Nov 09
es_es: Último cambio: 9/11/2008

source: Only Unix has support for this.
es_es: Solo Unix es compatible con esta función.

source: On other systems Vim will start a shell for you.
es_es: Vim iniciará una consola en otros sistemas.

source: This also has the functionality of being able to execute shell commands.
es_es: Esto también tiene la funcionalidad de permitirle ejecutar órdenes de consola.

source: But it's a new shell, not the one that you started Vim from.
es_es: Pero esta es una nueva consola, no desde la que inició Vim.

source: When you are running the GUI you can't go back to the shell where Vim was started.
es_es: Cuando está ejecutando la interfaz gráfica no puede volver a la consola desde la que se inició Vim.

source: CTRL-Z will minimize the Vim window instead.
es_es: En esta situación, CTRL-Z minimizará la ventana de Vim.

source: To execute a single shell command from Vim use ":!{command}".
es_es: Use «:!{orden}» para ejecutar una sola orden de consola desde Vim.

source: For example, to see a directory listing: >
es_es: Por ejemplo, para ver el listado de un directorio: >

source: The first one is for Unix, the second one for MS-Windows.
es_es: El primero es para Unix, el segundo para MS-Windows.

source: Vim will execute the program.
es_es: Vim ejecutará el programa.

source: When it ends you will get a prompt to hit <Enter>.
es_es: Cuando finalice, obtendrá un dialogo para pulsar <Intro>.

source: This allows you to have a look at the output from the command before returning to the text you were editing.
es_es: Esto le permite ver la salida de la orden antes de volver al texto que estaba editando.

source: The "!" is also used in other places where a program is run.
es_es: El signo «!» también se usa en otros sitios cuando se ejecuta un programa.

source: Let's take a look at an overview:
es_es: Veamos com funciona esto de una manera general.

source: Notice that the presence of a range before "!{program}" makes a big difference.
es_es: Nótese que la presencia de un rango antes de «!{programa}» marca una gran diferencia.

source: Without it executes the program normally, with the range a number of text lines is filtered through the program.
es_es: Sin él, ejecuta el programa de manera normal, con el rango se filtran un número de líneas a través del programa.

source: Executing a whole row of programs this way is possible.
es_es: Es imposible ejecutar una fila de programas de esta manera.

source: But a shell is much better at it.
es_es: Pero una consola es mejor para estas funciones.

source: You can start a new shell this way: >
es_es: Puede iniciar una nueva consola de la siguiente manera: >

source: This is similar to using CTRL-Z to suspend Vim.
es_es: Esto es parecido al uso de «CTRL-Z» para suspender Vim.

source: The difference is that a new shell is started.
es_es: La diferencia es que se inicia una nueva consola.

source: When using the GUI the shell will be using the Vim window for its input and output.
es_es: Al usar la GUI, la consola usará la ventana de Vim para entrada y salida.

source: Since Vim is not a terminal emulator, this will not work perfectly.
es_es: Ya que Vim no es una terminal, esto no funcionará perfectamente.

source: If you have trouble, try toggling the 'guipty' option.
es_es: Si tiene un problema, pruebe a conmutar la opción 'guipty'.

source: If this still doesn't work well enough, start a new terminal to run the shell in.
es_es: Si esto tampoco funciona, inicie una nueva terminal para iniciar el intérprete de órdenes.

source: For example with: > :!xterm&
es_es: Por ejemplo, con: > :!xterm&

source: Each time you exit Vim it will store this information in a file, the viminfo file.
es_es: Cada vez que cierre Vim, este guardará esta información en un archivo, el archivo viminfo.

source: When Vim starts again, the viminfo file is read and the information restored.
es_es: Cuando inicie Vim otra vez, leerá el archivo viminfo y restaurará la información.

source: The 'viminfo' option is set by default to restore a limited number of items.
es_es: La opción 'viminfo' esta configurada por omisión para almacenar un limitado número de elementos.

source: You might want to set it to remember more information.
es_es: Puede que desee configurarlo para que recuerde más información.

source: This is done through the following command: >
es_es: Esto se hace con la siguiente orden: >

source: The f option controls whether global marks (A-Z and 0-9) are stored.
es_es: La opción «f» controla si se guardan las marcas globales (A-Z y 0-9).

source: If this option is 0, none are stored.
es_es: Si esta opción es 0, no se guarda nada.

source: If it is 1 or you do not specify an f option, the marks are stored.
es_es: Si es 1 o no especificó una opción «f», las marcas se guardan.

source: You want this feature, so now you have this: >
es_es: Desea esta función, y por ello ahora obtiene esto: >

source: The < option controls how many lines are saved for each of the registers.
es_es: La opción «<» define el número de líneas a guardar por cada registro.

source: By default, all the lines are saved.
es_es: Por omisión, todas las líneas se guardan.

source: If 0, nothing is saved.
es_es: Si es 0, nada se guarda.

source: To avoid adding thousands of lines to your viminfo file (which might never get used and makes starting Vim slower) you use a maximum of 500 lines: >
es_es: Para evitar que se añadan miles de líneas a su archivo viminfo (que puede que nunca se usen, y ralenticen el arranque de Vim) puede usar un máximo de 500 líneas: >

source: If you want to go back to a file that you edited recently, but not when exiting Vim, there is a slightly more complicated way.
es_es: Si desea volver a un archivo que editó recientemente, pero no al cerrar Vim, hay una manera un tanto más complicada.

source: You can see a list of files by typing the command: >
es_es: Puede ver una lista de archivos tecleando la orden: >

source: Now you would like to edit the second file, which is in the list preceded by "2:".
es_es: Ahora le gustaría editar el segundo archivo, que está en la lista precedido por «2:».

source: You type: >
es_es: Teclee: >

source: Instead of ":e" you can use any command that has a file name argument, the "#<2" item works in the same place as "%" (current file name) and "#" (alternate file name).
es_es: En lugar de «:e», puede usar cualquier orden que tiene un nombre de archivo como argumento, el elemento «#<2» funciona en el mismo lugar que «%» (nombre del archivo actual) y «#» (nombre de archivo alterno).

source: So you can also split the window to edit the third file: >
es_es: Puede también dividir la ventana para editar el tercer archivo: >

source: That #<123 thing is a bit complicated when you just want to edit a file.
es_es: Usar #<123 es poco complicado cuando solo quiere editar un archivo.

source: Fortunately there is a simpler way: >
es_es: Afortunadamente, hay una manera más simple: >

source: You get the same list of files as with |:oldfiles|.
es_es: Obtendrá la misma lista de archivos que con |:oldfiles|.

source: If you want to edit "resume.txt" first press "q" to stop the listing.
es_es: Si desea editar «resume.txt», pulse primero «q» para detener el listado.

source: You will get a prompt:
es_es: Obtendrá un dialogo:

source: You can use the ":wviminfo" and ":rviminfo" commands to save and restore the information while still running Vim.
es_es: Puede emplear las órdenes «:wviminfo» y «:rviminfo» para guardar y restaurar la información mientras Vim se está ejecutando.

source: This is useful for exchanging register contents between two instances of Vim, for example.
es_es: Ésto es útil para intercambiar los contenidos del registro de dos instancias de Vim, por ejemplo.

source: In the first Vim do: >
es_es: En el primer Vim, haga: >

source: Obviously, the "w" stands for "write" and the "r" for "read".
es_es: Obviamente, «w» significa «write», y «r», «read».

source: The ! character is used by ":wviminfo" to forcefully overwrite an existing file.
es_es: El caracter «!» se usa por «:wviminfo» para forzar la sobreescritura de un archivo existente.

source: When it is omitted, and the file exists, the information is merged into the file.
es_es: Cuando se omite, y el archivo existe, la información es fusionada en el archivo.

source: The ! character used for ":rviminfo" means that all the information is used, this may overwrite existing information.
es_es: El caracter «!» usado por «:rviminfo» significa que se usa toda la información, y esto puede sobreescribir información ya presente.

source: Without the ! only information that wasn't set is used.
es_es: Sin «!» sólo se usa la información que no estaba definida.

source: These commands can also be used to store info and use it again later.
es_es: Estas órdenes se pueden usar también para guardar info y usarlo más tarde.

source: You could make a directory full of viminfo files, each containing info for a different purpose.
es_es: Puede crear un directorio lleno de archivos «viminfo», cada uno con info dependiendo del propósito.

source: This tells Vim to read a specific file on startup.
es_es: Esto le dice a Vim que lea un archivo en particular al inicio.

source: The 'S' stands for session (actually, you can source any Vim script with -S, thus it might as well stand for "source").
es_es: La «S» significa sesión (en realidad, puede introducir cualquier script a Vim con «-S», por ello también puede significar «source», fuente).

source: The windows that were open are restored, with the same position and size as before.
es_es: Las ventanas que estaban abiertas se restauran, con la misma posición y tamaño que antes.

source: Mappings and option values are like before.
es_es: Las macros y valores de opciones son también las mismas.

source: What exactly is restored depends on the 'sessionoptions' option.
es_es: Lo que se restaura exactamente depende de la opción 'sessionoptions'.

source: The default value is "blank,buffers,curdir,folds,help,options,winsize".
es_es: El valor predeterminado es «blank,buffers,curdir,folds,help,options,winsize».

source: Change this to your liking.
es_es: Modifique esto según su convenienvia.

source: To also restore the size of the Vim window, for example, use: >
es_es: Para también restaurar el tamaño de la ventana de Vim use, por ejemplo: >

source: The obvious way to use sessions is when working on different projects.
es_es: La manera obvia de usar sesiones es cuando trabaja en diferenes proyetos.

source: Suppose you store you session files in the directory "~/.vim".
es_es: Suponga que guarda sus archivos de sesión en el directorio «~/.vim».

source: You are currently working on the "secret" project and have to switch to the "boring" project: >
es_es: Está trabajando actualmente en el proyecto «secreto» y tiene que cambiar al proyecto «aburrido»: >

source: ~/.vim/secret.vim :source ~/.vim/boring.vim
es_es: ~/.vim/secreto.vim :source ~/.vim/aburrido.vim

source: Thus you have complete control over whether you want to continue next time where you are now, by saving the current setup in a session, or keep the session file as a starting point.
es_es: Por ello, ahora tiene un completo control sobre continuar en el mismo punto la siguiente vez que lo abra, guardando la configuración actual en una sesión, o mantener el archivo de sesión como un punto de partida.

source: Another way of using sessions is to create a window layout that you like to use, and save this in a session.
es_es: Otra manera de usar sesiones es crear una organización de ventana que le gusta usar, y guardarla en una sesión.

source: Then you can go back to this layout whenever you want.
es_es: Después podrá volver a este orden siempre que quiera.

source: For example, this is a nice layout to use:
es_es: Por ejemplo, esta es una bonita organización que puede usar:

source: This has a help window at the top, so that you can read this text.
es_es: Ésta tiene una ventana de ayuda en la parte superior, para que pueda leer este texto.

source: The narrow vertical window on the left contains a file explorer.
es_es: La estrecha ventana vertical a la izquierda contiene un explorador de archivos.

source: This is a Vim plugin that lists the contents of a directory.
es_es: Esta es una extensión de Vim que lista los contenidos de un directorio.

source: You can select files to edit there.
es_es: Puede seleccionar qué archivos editar ahí.

source: More about this in the next chapter.
es_es: Más acerca de esto en el siguiente capítulo.

source: Create this from a just started Vim with: >
es_es: Puede crear esto con una instancia nueva de Vim con: >

source: You can resize the windows a bit to your liking.
es_es: Puede redimensionar las ventanas a su gusto.

source: Then save the session with: > :mksession ~/.vim/mine.vim
es_es: Guarde entonces la sesión con: > :mksession ~/.vim/mio.vim

source: Hint: To open a file you see listed in the explorer window in the empty window, move the cursor to the filename and press "O".
es_es: Pista: Para abrir un archivo que vea listado en la ventana del explorador en la ventana vacía, mueva el cursor al nombre del archivo y pulse «O».

source: Double clicking with the mouse will also do this.
es_es: Pulsar dos veces con el ratón le daría el mismo resultado.
